{
  "heading": {
    "title": "Sistem Pakar — Diagnosis Tuberkulosis!",
    "subtitle": "Aplikasi ini digunakan untuk mendiagnosis penyakit Tuberkulosis. Kami telah mengimplementasikan algoritma Forward Chaining dan Certainty Factor. Mohon menjawab pertanyaan di bawah ini!"
  },
  "general": {
    "darken": "Gelapkan",
    "lighten": "Terangkan",
    "analyze": "Analisis jawaban",
    "results": "Hasil",
    "notComplete": "Mohon isi seluruh informasi terlebih dahulu!"
  },
  "tooltips": {
    "color": "Ubah mode warna",
    "github": "Akses GitHub",
    "about": "Tentang sistem",
    "terms": "Syarat dan ketentuan",
    "lang": "Ubah bahasa"
  },
  "notFound": {
    "title": "Tidak ditemukan!",
    "message": "Halaman yang Anda cari mungkin (tidak) ada di masa lampau, tetapi sekarang sudah pasti tidak ada.",
    "back": "Kembali ke Home"
  },
  "tbSymptoms": {
    "symptomOne": "Saya menderita demam untuk dua minggu atau lebih",
    "symptomTwo": "Saya batuk darah",
    "symptomThree": "Lendir saya bercampur dengan darah",
    "symptomFour": "Saya berkeringat pada malam hari",
    "symptomFive": "Saya menderita sakit dada secara kontinyu",
    "symptomSix": "Saya menderita sakit punggung secara kontinyu",
    "symptomSeven": "Saya merasa sulit bernafas",
    "symptomEight": "Saya mengalami penurunan berat badan",
    "symptomNine": "Badan saya selalu terasa lelah",
    "symptomTen": "Di sekitar ketiak dan leher, muncul gumpalan",
    "symptomEleven": "Saya batuk secara terus menerus dari dua hingga empat minggu",
    "symptomTwelve": "Nodus limfa saya berkembang",
    "symptomThirteen": "Saya mengalami penurunan nafsu makan"
  },
  "menu": {
    "doNotFeelSo": "Tidak pernah merasa",
    "sometimesFeelSo": "Terkadang merasa",
    "oftenFeelSo": "Sering merasa",
    "stronglyFeelSo": "Selalu merasa"
  },
  "disclaimer": {
    "title": "Pernyataan & Kebijakan",
    "alert": "Mohon membaca ini sebelum menggunakan aplikasi!",
    "initial": "Meskipun aplikasi ini dibuat berdasarkan data yang sudah ada dan mendapatkan opini dari pakar yang bersangkutan, aplikasi ini masih bukan merupakan cara yang benar untuk mendiagnosis diri Anda. Anda dapat menggunakan aplikasi ini seperti pertolongan pertama apabila Anda perlu mengetahui kondisi Anda secepatnya. Aplikasi ini hanya dibuat untuk kepentingan penelitian dan pendidikan.",
    "privacy": "Dalam situs ini, kami menggunakan teknologi cookie untuk menyimpan preferensi color mode milik Anda. Kami tidak menggunakan data Anda untuk kepentingan apapun. Untuk lisensi, seluruh penggunaan telah disitasi secara sesuai, baik di dalam aplikasi ini maupun dalam repositori kode aplikasi ini.",
    "warning": "Aplikasi ini BUKAN untuk diinterpretasikan atau dipahami sebagai nasihat medis yang resmi. Konsultasi dengan dokter atau tenaga kesehatan di daerah Anda apabila Anda ingin mendiagnosis diri Anda secara lebih detail yang lebih sesuai dengan kondisi kesehatan Anda. Gunakan alat ini secara bijaksana. Apabila Anda membutuhkan nasihat medis khusus untuk kondisi kesehatan Anda secara spesifik dan terspesialisasi, JANGAN MENGGUNAKAN APLIKASI INI SAMA SEKALI.",
    "license": "Perangkat lunak ini disediakan dengan sebagaimana adanya, tanpa garansi apapun, secara langsung maupun tidak langsung, termasuk tetapi tidak terbatas pada garansi penjualan dagang, kegunaan untuk tujuan tertentu, dan bukan merupakan pelanggaran. Tidak ada dalam segala jenis kegiatan atau aktivitas manapun penulis atau pemegang hak cipta dapat dituntut atau dapat dimintai pertanggungjawaban atas klaim apa pun, kerusakan, atau kewajiban lainnya, baik melalui aksi dalam kontrak tertulis maupun tidak tertulis, yang berkaitan dengan penggunaan perangkat lunak ini, baik secara langsung maupun tidak langsung.",
    "agreement": "Mohon centang dua buah boks di bawah ini sebagai tanda persetujuan Anda.",
    "understand": "Saya mengerti dan menyetujui tentang penggunaan di atas.",
    "responsibility": "Seluruh penggunaan aplikasi ini merupakan tanggung jawab saya sendiri.",
    "close": "Saya mengerti."
  },
  "about": {
    "title": "Tentang",
    "alert": "Tentang aplikasi—dalam bahasa non-teknis",
    "purpose": "Kegunaan",
    "content": "Aplikasi ini dibangun untuk mendiagnosis orang yang memiliki kemungkinan terinfeksi oleh TB. Dengan konsep teknis yang dinamai 'Sistem Pakar', dimungkinkan bagi seseorang untuk mendiagnosis orang berdasarkan gejala-gejala yang dikuantitatifkan. Gejala-gejala ini akan diproses dengan algoritma untuk menghasilkan sebuah analisis prediksi dan keputusan apakah seseorang terinfeksi dengan TB atau tidak. Algoritme yang digunakan dalam penelitian ini adalah Forward Chaining dan Certainty Factor, yang mana seluruh konsepnya akan dijelaskan dalam tampilan modal ini.",
    "dataProcessing": "Pemrosesan Data",
    "dataProcessingExplanation": "Sebelum melanjutkan dengan kalkulasi, sangat penting untuk menerapkan pemrosesan data terlebih dahulu, agar bisa mengetahui bagaimana cara meng-'kuantitatif'-kan gejala tersebut. Dataset yang digunakan dalam penelitian ini adalah 'TB Symptoms' dari Kaggle. Data diproses lebih lanjut dengan mengalkulasikan rata-rata jumlah gejala yang muncul untuk masing-masing gejala. Secara logis, angka ini dapat digunakan sebagai konstanta yang kuantitatif untuk kalkulasi berikutnya. Lebih lanjut, juga dilakukan kalkulasi rata-rata gejala yang dialami pasien untuk mengetahui jumlah rata-rata gejala yang seseorang biasanya memiliki ketika mereka terinfeksi dengan TB.",
    "algorithmOne": "Forward Chaining",
    "algorithmOneExplanation": "Forward Chaining adalah algoritma dimana peraturan inferensi diimplementasikan kepada data yang sudah ada untuk mengekstrak informasi tambahan hingga tujuan tercapai. Umumnya, algoritma ini dapat diselesaikan dengan bantuan AND, OR, NOR, dan ekspresi matematika diskrit/boolean lainnya. Proses dari algoritma ini mengedepankan top-down approach, memulai dari sebuah initial state dan menggunakan fakta-fakta untuk mendapatkan kesimpulan, dan biasanya algoritma ini diimplementasikan pada Sistem Pakar. Dalam aplikasi ini, rata-rata jumlah gejala yang biasanya dimiliki oleh orang yang menderita TB akan digunakan sebagai konstanta. Apabila angka gejala melebihi konstanta tersebut, maka kemungkinan terinfeksi TB.",
    "algorithmTwo": "Certainty Factor",
    "algorithmTwoExplanation": "Certainty Factor adalah sebuah algoritma yang merupakan alternatif dari Bayesian Reasoning ketika tidak ada informasi statistik yang reliabel atau bukti yang konkret tidak dapat diasumsikan - dan membawa kalkulus tingkat kepercayaan / certainty factors yang didasarkan pada pakar. Konstanta rata-rata jumlah gejala (yang dijelaskan di atas) tersebut digunakan sebagai konstanta dasar untuk perhitungan algoritme ini. Certainty Factors atau tingkat kepercayaan biasanya dibagi menjadi dua; yakni tingkat kepercayaan pengguna, dan tingkat kepercayaan pakar. Keduanya digunakan dalam aplikasi ini untuk mendapatkan hasil yang mendalam.",
    "process": "Proses Aplikasi",
    "inferenceProcess": "Anda mengumpulkan gejala → aplikasi akan mencoba membuat keputusan tentang kondisi Anda → Anda mendapatkan hasil → Anda selesai dan boleh berkonsultasi kepada tenaga kesehatan untuk kondisi pribadi Anda. Apabila Anda ingin melihat kalkulasi lebih dalam, Anda dapat melihat kode sumber dari aplikasi.",
    "references": "Daftar Pustaka",
    "referencesAndSource": "Seluruh referensi, pengakuan, dan dokumentasi yang lebih lengkap dapat dilihat pada repositori GitHub aplikasi ini. Terima kasih kepada mereka yang telah membantu untuk membangun penelitian ini dan menyediakan penelitian terdahulu sebagai landasan penelitian!",
    "close": "OK!"
  },
  "inference": {
    "title": "Hasil Inferensi",
    "alert": "Hasil Anda adalah sebagai berikut.",
    "verdict": "Kondisi",
    "verdictTB": "Dari analisis dan sistem kami, diduga Anda menderita penyakit TB.",
    "verdictNoTB": "Dari analisis dan sistem kami, diduga Anda tidak menderita penyakit TB.",
    "verdictCalculation": "Kalkulasi dilakukan dengan metode Forward Chaining dan mendapatkan hasil seperti di atas.",
    "probability": "Probabilitas",
    "probabilityResult": "Angka probabilitas Anda terinfeksi TB adalah {{probability}}%.",
    "probabilityCalculation": "Kalkulasi dilakukan dengan metode Certainty Factor dan mendapatkan hasil seperti di atas.",
    "suggestion": "Saran",
    "suggestionOkay": "Menimbang dari nilai probabilitas, Anda tidak ada risiko untuk menderita TB. Namun, akan selalu baik bagi Anda untuk pergi dan mendapatkan konsultasi kesehatan dari dokter atau tenaga kesehatan lainnya. Tetap jaga kesehatan dan keamanan!",
    "suggestionVisit": "Menimbang dari nilai probabilitas, Anda memilik risiko ringan untuk menderita TB. Direkomendasikan bagi Anda untuk pergi dan mendapatkan konsultasi medis dari dokter ataupun tenanga kesehatan lainnya. Diharapkan, Anda tidak apa-apa. Tetap jaga kesehatan dan keamanan!",
    "suggestionDangerous": "Dari nilai probabilitas, Anda memiliki risiko tinggi untuk menderita TB sekarang. Sangat direkomendasikan bagi Anda untuk langsung pergi ke rumah sakit dan mendapatkan pemeriksaan medis dengan dokter. Mohon jaga kesehatan dan keamanan!",
    "information": "Informasi",
    "prevention": "Pencegahan",
    "treatment": "Perawatan",
    "sources": "Sumber",
    "sourcesBeginning": "Sumber-sumber data untuk penyakit didapatkan melalui sumber berikut:",
    "json": "JSON",
    "jsonBeginning": "Data mentahan untuk yang berminat.",
    "showCode": "Lihat data",
    "hideCode": "Sembunyikan data",
    "close": "Tutup"
  },
  "footer": "Aplikasi ES ini merupakan hasil karya dari para pembuat."
}
