{
  "heading": {
    "title": "Hello, Expert Systems!"
  },
  "general": {
    "darken": "Darken",
    "lighten": "Lighten",
    "analyze": "Analyze answers",
    "results": "Results"
  },
  "tbSymptoms": {
    "symptomOne": "I have a fever for two weeks or more.",
    "symptomTwo": "I cough blood",
    "symptomThree": "My sputum is mixed with blood",
    "symptomFour": "I sweat at night",
    "symptomFive": "I suffer from chest pain constantly",
    "symptomSix": "I suffer from back pain constantly",
    "symptomSeven": "I feel a shortness of breath",
    "symptomEight": "I have experienced weight loss",
    "symptomNine": "My body feels like always tired",
    "symptomTen": "Around my armpits and neck, lumps appeared",
    "symptomEleven": "I cough continously from two weeks to four weeks",
    "symptomTwelve": "My lymph nodes are swollen",
    "symptomThirteen": "I experienced a loss of apetite"
  },
  "menu": {
    "doNotFeelSo": "I do not/never feel so",
    "sometimesFeelSo": "I sometimes feel so",
    "oftenFeelSo": "I often feel so",
    "stronglyFeelSo": "I strongly feel so"
  },
  "disclaimer": {
    "title": "Disclaimer & Terms",
    "alert": "Please read the terms and conditions before using this application!",
    "initial": "Even though this application is made based on available data and the opinion of the pertaining experts, this application is still not a fully correct way to diagnose yourself with. You can use this application as a first-aid kind of situation if you need to get to know about your condition as fast as possible. This application is made for research and educational purposes only.",
    "privacy": "In this website, we use cookies in order to store your color mode preferences. We do not use your data for anything. As for licenses, all of the usages are cited properly, either in this app or in the repository.",
    "warning": "This application IS NOT to be construed as a complete medical advice. Consult a medical expert in your area if you need to diagnose yourself in a more detailed way that is more catered to your needs. Use this tool with responsibility. If you need a specialized medical advice for your condition, DO NOT USE THIS APPLICATION.",
    "license": "This software is provided \"as is\", without warranty of any kind, express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose and noninfringement. In no event shall the authors or copyright holders be liable for any claim, damages or other liability, whether in an action of contract, tort or otherwise, arising from, out of or in connection with the software or the use or other dealings in the software.",
    "agreement": "Please check below boxes to continue with this application.",
    "understand": "I understand the terms written above.",
    "responsibility": "All of the usage is my own responsibility."
  },
  "about": {
    "title": "About",
    "alert": "About the app",
    "content": "Pre-memory"
  },
  "inference": {
    "title": "Inference Result",
    "alert": "Your results are as follows.",
    "verdict": "Verdict",
    "verdictCalculation": "The calculation was done by using the Forward Chaining Algorithm and provides above result.",
    "probability": "Probability",
    "probabilityCalculation": "The calculation was done by using the Certainty Factor Algorithm and provides above result.",
    "suggestion": "Suggestion",
    "information": "Information",
    "prevention": "Prevention",
    "treatment": "Treatment",
    "sources": "Sources",
    "sourcesBeginning": "The sources of the data regarding of the disease are taken from the following sources:"
  },
  "footer": {
    "github": "GitHub",
    "about": "Tentang",
    "terms": "Kebijakan"
  }
}
